wisteria-1c/Конфигурация/InformationRegisters/ТекущиеВходящиеЗвонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеВходящиеЗвонки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АбонентОтКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лиды</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефонаАбонента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВходящееИсходящее</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВходящееИсходящееСобытие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗвонкаВАТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПользовательКому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/НеобрабатываемыеТелефонныеНомера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НеобрабатываемыеТелефонныеНомера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерТелефонаАбонента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ТекущиеВходящиеЗвонки/Forms/НеизвестныйАбонент/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МенеджерЗаписи = РегистрыСведений.ТекущиеВходящиеЗвонки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПользовательКому = Параметры.ПользовательКому;
	МенеджерЗаписи.Прочитать();
	
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "Запись");
	
	Если НЕ ЗначениеЗаполнено(МенеджерЗаписи.Событие) И ЗначениеЗаполнено(МенеджерЗаписи.ИдентификаторЗвонкаВАТС) Тогда
		ДанныеЗвонка = ТелефонияСервер.НовыйДанныеЗвонка();
		ДанныеЗвонка.ИдентификаторЗвонкаВАТС = МенеджерЗаписи.ИдентификаторЗвонкаВАТС;
		Событие = ТелефонияСервер.НайтиСобытиеПоДаннымЗвонка(ДанныеЗвонка);
	Иначе
		Событие = МенеджерЗаписи.Событие;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьКонтрагента(Команда)
	
	УдалитьЗаписьТекущегоВходящегоЗвонка();
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Покупатель", Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ТипКИТелефон = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
	
	ПараметрКакСвязаться = Новый Структура;
	ПараметрКакСвязаться.Вставить("ВидКонтакта",  "Контрагент");
	ПараметрКакСвязаться.Вставить("Контакт",      "");
	ПараметрКакСвязаться.Вставить("КакСвязаться", Запись.НомерТелефонаАбонента);
	ПараметрКакСвязаться.Вставить("ТипКИ",        ТипКИТелефон);
	
	ПараметрыФормы.Вставить("КонтактКакСвязаться", ПараметрКакСвязаться);
	
	Закрыть();
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокКонтрагентов(Команда)
	
	УдалитьЗаписьТекущегоВходящегоЗвонка();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Покупатель", Истина));
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "СписокПокупателей");
	
	Закрыть();
	ОткрытьФорму("Справочник.Контрагенты.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиСобытие(Команда)
	
	УдалитьЗаписьТекущегоВходящегоЗвонка();
	
	Закрыть();
	ПоказатьЗначение(, Событие);
	
КонецПроцедуры

&НаКлиенте
Процедура Игнорировать(Команда)
	
	УдалитьЗаписьТекущегоВходящегоЗвонка();
	ДобавитьНеобрабатываемыйНомер(Запись.НомерТелефонаАбонента);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛид(Команда)
	
	УдалитьЗаписьТекущегоВходящегоЗвонка();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтактКакСвязаться", Новый Структура);
	ПараметрыФормы.КонтактКакСвязаться.Вставить("Контакт", "");
	ПараметрыФормы.КонтактКакСвязаться.Вставить("КакСвязаться", Запись.НомерТелефонаАбонента);
	ПараметрыФормы.КонтактКакСвязаться.Вставить("ТипКИ", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	
	Закрыть();
	ОткрытьФорму("Справочник.Лиды.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УдалитьЗаписьТекущегоВходящегоЗвонка()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТекущиеВходящиеЗвонки.ПользовательКому КАК ПользовательКому
	|ИЗ
	|	РегистрСведений.ТекущиеВходящиеЗвонки КАК ТекущиеВходящиеЗвонки
	|ГДЕ
	|	ТекущиеВходящиеЗвонки.Событие = &Событие";
	Запрос.УстановитьПараметр("Событие", Запись.Событие);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ТекущиеВходящиеЗвонки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПользовательКому = Выборка.ПользовательКому;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьНеобрабатываемыйНомер(Номер)
	
	МенеджерЗаписи = РегистрыСведений.НеобрабатываемыеТелефонныеНомера.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НомерТелефонаАбонента = Номер;
	МенеджерЗаписи.Автор = Пользователи.АвторизованныйПользователь();
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
